python
python-pip
go
ripgrep
fzf
zip
unzip
noto-fonts
ttf-dejavu
ttf-liberation
ttf-iosevka-nerd # terminal font
neofetch
jq
yamllint
shellcheck
nodejs-lts-gallium # nodejs 16 lts
npm
yarn
pandoc
virt-manager  # required by libvirt
qemu # required by libvrit
dnsmasq # required by libvrit
dmidecode # required by libvrit
bc
yt-dlp  # youtube-dl fork
mpv  # video player
kubectl
minio-client
libpcap
mosquitto
openresolv
wireguard-tools
cmake
pigz  # required by docker
docker
wireshark-qt
tree  # required by fzf-projects
fd  # required by fzf-projects
usbutils  # lsusb
xclip
inetutils  # hostname
ttf-ubuntu-font-family
picom  # qtile
dunst  # qtile
volumeicon # qtile
network-manager-applet # qtile
blueman-applet # qtile
nitrogen  # qtile
lxappearance  # qtile
